Revit 2027 API
ExportUtils Class
 This class provides utilities related to document export.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExportUtils
Public NotInheritable Class ExportUtils
public ref class ExportUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExportUtils = class end
The ExportUtils type exposes the following members.
Methods
Name | Description
GetExportId(Subelement) |  Retrieves the GUID representing the subelement in DWF and IFC export.
GetExportId(Document, ElementId) |  Retrieves the GUID representing this element in DWF and IFC export.
GetGBXMLDocumentId |  Retrieves the GUID representing this document in exported gbXML files.
GetNurbsSurfaceDataForSurface |  Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface].
Top
See Also
Reference
Autodesk.Revit.DB Namespace